Repository: pypi-data/pypi-mirror-401
Catalog: packages/auth-playground/auth_playground-0.1.6-py3-none-any.whl/auth_playground/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Cannot connect to the server. Please check the URL.
fr: Impossible de se connecter au serveur. Veuillez vérifier l'URL.

source: Connection timeout. The server is not responding.
fr: Délai de connexion dépassé. Le serveur ne répond pas.

source: This server does not support OIDC Discovery or OAuth 2.0 Authorization Server Metadata
fr: Ce serveur ne prend pas en charge OIDC Discovery ou les métadonnées du serveur d'autorisation OAuth 2.0

source: Server returned an error: HTTP {status_code}
fr: Le serveur a renvoyé une erreur : HTTP {status_code}

source: Failed to connect to the server. Please check the URL.
fr: Échec de connexion au serveur. Veuillez vérifier l'URL.

source: Invalid response from server
fr: Réponse invalide du serveur

source: OAuth configuration is set via environment variables and cannot be changed
fr: La configuration OAuth est définie via des variables d'environnement et ne peut pas être modifiée

source: You can now configure a different identity provider
fr: Vous pouvez maintenant configurer un fournisseur d'identité différent

source: Server metadata successfully loaded
fr: Métadonnées du serveur chargées avec succès

source: OAuth client is set via environment variables and cannot be changed
fr: Le client OAuth est défini via des variables d'environnement et ne peut pas être modifié

source: Please configure a server
fr: Veuillez configurer un serveur

source: OAuth configuration completed successfully
fr: Configuration OAuth terminée avec succès

source: No server configured
fr: Aucun serveur configuré

source: Renew tokens
fr: Renouveler les jetons

source: URL must start with http:// or https://
fr: L'URL doit commencer par http:// ou https://

source: HTTP is only allowed for localhost or in debug/testing mode. Use HTTPS in production.
fr: HTTP n'est autorisé que pour localhost ou en mode débogage/test. Utilisez HTTPS en production.

source: Provider URL:
fr: URL du fournisseur :

source: Provider URL is required
fr: L'URL du fournisseur est requise

source: Enter the base URL of your OIDC/OAuth2 provider (e.g., https://auth.example.com)
fr: Entrez l'URL de base de votre fournisseur OIDC/OAuth2 (par ex., https://auth.exemple.com)

source: Continue
fr: Continuer

source: Client ID:
fr: ID du client :

source: Client ID is required
fr: L'ID du client est requis

source: Client ID must be between 1 and 255 characters
fr: L'ID du client doit contenir entre 1 et 255 caractères

source: Client secret:
fr: Secret du client :

source: Client Secret is required
fr: Le secret du client est requis

source: Complete configuration
fr: Terminer la configuration

source: Initial access token:
fr: Jeton d'accès initial :

source: Leave empty if not required
fr: Laisser vide si non requis

source: Register client
fr: Enregistrer le client

source: Unregister client
fr: Désinscrire le client

source: Scopes:
fr: Portées :

source: Select the scopes to request from the authorization server
fr: Sélectionnez les portées à demander au serveur d'autorisation

source: Prompt:
fr: Invite :

source: None - No UI
fr: Aucune - Pas d'interface

source: Login - Force re-authentication
fr: Connexion - Forcer la ré-authentification

source: Consent - Force consent
fr: Consentement - Forcer le consentement

source: Select account
fr: Sélectionner le compte

source: Create - Registration
fr: Création - Inscription

source: Control the authentication UI behavior
fr: Contrôler le comportement de l'interface d'authentification

source: UI Locale:
fr: Langue de l'interface :

source: Preferred language for the authentication UI
fr: Langue préférée pour l'interface d'authentification

source: Invalid request
fr: Requête invalide

source: Server metadata not found
fr: Métadonnées du serveur introuvables

source: Dynamic client registration not supported
fr: L'enregistrement dynamique de client n'est pas pris en charge

source: Dynamic client registration failed
fr: Échec de l'enregistrement dynamique du client

source: Dynamic client registration failed: {error}
fr: Échec de l'enregistrement dynamique du client : {error}

source: Invalid JSON response from registration endpoint
fr: Réponse JSON invalide du point de terminaison d'enregistrement

source: Client successfully registered!
fr: Client enregistré avec succès !

source: Client registration management credentials not found
fr: Identifiants de gestion de l'enregistrement du client introuvables

source: Client unregistration failed
fr: Échec de la désinscription du client

source: Client unregistration failed: {error}
fr: Échec de la désinscription du client : {error}

source: Client successfully unregistered
fr: Client désinscrit avec succès

source: You have been successfully logged in.
fr: Vous avez été connecté avec succès.

source: An error happened during login: {error}
fr: Une erreur s'est produite lors de la connexion : {error}

source: You have been logged out
fr: Vous avez été déconnecté

source: You have been logged out from the server
fr: Vous avez été déconnecté du serveur

source: No refresh token available
fr: Aucun jeton de rafraîchissement disponible

source: Token successfully refreshed
fr: Jeton rafraîchi avec succès

source: An error happened during token refresh: {error}
fr: Une erreur s'est produite lors du rafraîchissement du jeton : {error}

source: Token information
fr: Informations sur les jetons

source: Here are the tokens received from the %(display_name)s:
fr: Voici les jetons reçus du %(display_name)s :

source: ID token & user information
fr: Jeton d'identité et informations utilisateur

source: Contains user identity information in JWT format.
fr: Contient les informations d'identité de l'utilisateur au format JWT.

source: Copy
fr: Copier

source: User claims
fr: Revendications utilisateur

source: User name:
fr: Nom d'utilisateur :

source: Display name:
fr: Nom d'affichage :

source: Full name:
fr: Nom complet :

source: Given name:
fr: Prénom :

source: Family name:
fr: Nom de famille :

source: Email verified:
fr: Email vérifié :

source: Phone:
fr: Téléphone :

source: Address:
fr: Adresse :

source: Locale:
fr: Langue :

source: Timezone:
fr: Fuseau horaire :

source: Birthdate:
fr: Date de naissance :

source: Gender:
fr: Genre :

source: Website:
fr: Site web :

source: Groups:
fr: Groupes :

source: Token metadata
fr: Métadonnées du jeton

source: Issuer:
fr: Émetteur :

source: Auth time:
fr: Heure d'authentification :

source: Issued at:
fr: Émis le :

source: Expires at:
fr: Expire le :

source: Access token hash:
fr: Hachage du jeton d'accès :

source: Code hash:
fr: Hachage du code :

source: Auth context class:
fr: Classe de contexte d'authentification :

source: Auth methods:
fr: Méthodes d'authentification :

source: Authorized party:
fr: Partie autorisée :

source: Access token
fr: Jeton d'accès

source: Used to access protected resources on behalf of the user.
fr: Utilisé pour accéder aux ressources protégées au nom de l'utilisateur.

source: Token type:
fr: Type de jeton :

source: Expires in:
fr: Expire dans :

source: %(seconds)s seconds
fr: %(seconds)s secondes

source: Scope:
fr: Portée :

source: Refresh token
fr: Jeton de rafraîchissement

source: Used to obtain new access tokens without re-authentication.
fr: Utilisé pour obtenir de nouveaux jetons d'accès sans nouvelle authentification.

source: Configure OAuth Client
fr: Configurer le client OAuth

source: Choose a configuration method
fr: Choisissez une méthode de configuration

source: The %(display_name)s configuration has been successfully loaded. Now register your client at the %(display_name)s. Select one of the following options:
fr: La configuration de %(display_name)s a été chargée avec succès. Enregistrez maintenant votre client auprès de %(display_name)s. Sélectionnez l'une des options suivantes :

source: Dynamic registration
fr: Enregistrement dynamique

source: This server supports
fr: Ce serveur prend en charge

source: dynamic client registration
fr: l'enregistrement dynamique de client

source: Provide an Initial Access Token if required, then click the button to automatically register this application.
fr: Fournissez un jeton d'accès initial si nécessaire, puis cliquez sur le bouton pour enregistrer automatiquement cette application.

source: What happens next?
fr: Que se passe-t-il ensuite ?

source: A new OAuth client will be created automatically at the %(display_name)s, with the correct configuration,
fr: Un nouveau client OAuth sera créé automatiquement sur %(display_name)s, avec la bonne configuration,

source: Client ID and Secret will be generated by the server,
fr: L'ID et le secret du client seront générés par le serveur,

source: Configuration will be stored in your session.
fr: La configuration sera stockée dans votre session.

source: Manual configuration
fr: Configuration manuelle

source: Manually register the client at the %(display_name)s, then enter the client credentials below.
fr: Enregistrez manuellement le client auprès de %(display_name)s, puis entrez les identifiants du client ci-dessous.

source: %(display_name)s configuration
fr: Configuration de %(display_name)s

source: When creating your OAuth client at the %(display_name)s, configure these URIs:
fr: Lors de la création de votre client OAuth sur %(display_name)s, configurez ces URIs :

source: Redirect URIs
fr: URIs de redirection

source: Post-Logout Redirect URIs
fr: URIs de redirection après déconnexion

source: Configure Server
fr: Configurer le serveur

source: Choose a provider
fr: Choisir un fournisseur

source: Auth Playground will fetch the server's metadata from
fr: Auth Playground récupérera les métadonnées du serveur depuis

source: or
fr: ou

source: If valid, Auth Playground will show you multiple configuration options:
fr: Si valide, Auth Playground vous montrera plusieurs options de configuration :

source: Automatic registration (if supported)
fr: Enregistrement automatique (si pris en charge)

source: Manual configuration via web form
fr: Configuration manuelle via formulaire web

source: Environment variables setup
fr: Configuration via variables d'environnement

source: OAuth 2.0 Demonstration Client
fr: Client de démonstration OAuth 2.0

source: playground
fr: bac à sable

source: tokens
fr: jetons

source: specs
fr: spécifications

source: switch
fr: changer

source: Terms of Service
fr: Conditions d'utilisation

source: Privacy Policy
fr: Politique de confidentialité

source: You need to sign in first to view token information.
fr: Vous devez d'abord vous connecter pour voir les informations de jeton.

source: Go to playground
fr: Aller au bac à sable

source: Powered by
fr: Propulsé par

source: Sign in to explore OAuth 2.0 and OpenID Connect flows. Test registration, authentication, token refresh, and logout operations.
fr: Connectez-vous pour explorer les flux OAuth 2.0 et OpenID Connect. Testez l'inscription, l'authentification, le rafraîchissement des jetons et les opérations de déconnexion.

source: Authorization parameters
fr: Paramètres d'autorisation

source: Sign in
fr: Se connecter

source: Sign in again
fr: Se connecter à nouveau

source: Consent again
fr: Consentir à nouveau

source: Log out
fr: Se déconnecter

source: Server log out
fr: Déconnexion du serveur

source: Overview
fr: Aperçu

source: Auth Playground is a <strong>demonstration tool</strong> for OpenID Connect authentication.
fr: Auth Playground est un <strong>outil de démonstration</strong> pour l'authentification OpenID Connect.

source: What Data Is Handled
fr: Quelles données sont traitées

source: When you authenticate through Auth Playground, the following information is received from your identity provider:
fr: Lorsque vous vous authentifiez via Auth Playground, les informations suivantes sont reçues de votre fournisseur d'identité :

source: Access token:
fr: Jeton d'accès :

source: Used to access protected resources
fr: Utilisé pour accéder aux ressources protégées

source: Refresh token:
fr: Jeton de rafraîchissement :

source: Used to obtain new access tokens (if provided)
fr: Utilisé pour obtenir de nouveaux jetons d'accès (si fourni)

source: ID token:
fr: Jeton d'identité :

source: Contains your identity information in JWT format
fr: Contient vos informations d'identité au format JWT

source: User information:
fr: Informations utilisateur :

source: Profile data such as name, email, phone, address, groups, etc.
fr: Données de profil telles que nom, email, téléphone, adresse, groupes, etc.

source: The exact data received depends on the scopes requested and what your identity provider shares.
fr: Les données exactes reçues dépendent des portées demandées et de ce que votre fournisseur d'identité partage.

source: How Data Is Stored
fr: Comment les données sont stockées

source: All authentication data is stored server-side in memory.
fr: Toutes les données d'authentification sont stockées en mémoire côté serveur.

source: Data is stored in <strong>server memory</strong> (RAM) only
fr: Les données sont stockées uniquement dans la <strong>mémoire du serveur</strong> (RAM)

source: A secure session cookie is sent to your browser (containing only a session ID, not the actual data)
fr: Un cookie de session sécurisé est envoyé à votre navigateur (contenant uniquement un ID de session, pas les données réelles)

source: No database, files, or permanent storage is used
fr: Aucune base de données, fichier ou stockage permanent n'est utilisé

source: All session data is lost when the application restarts
fr: Toutes les données de session sont perdues au redémarrage de l'application

source: Data is cleared when you log out
fr: Les données sont effacées lorsque vous vous déconnectez

source: Sessions expire after %(timeout)s
fr: Les sessions expirent après %(timeout)s

source: Sessions expire when you close your browser
fr: Les sessions expirent lorsque vous fermez votre navigateur

source: Data Sharing
fr: Partage de données

source: Auth Playground does not:
fr: Auth Playground ne :

source: Share your data with third parties
fr: Partage pas vos données avec des tiers

source: Send data to external services
fr: Envoie pas de données vers des services externes

source: Store data permanently
fr: Stocke pas les données de manière permanente

source: Track your usage
fr: Suit pas votre utilisation

source: Use analytics or advertising
fr: Utilise pas d'analyse ou de publicité

source: The only external communication is with your configured identity provider for authentication purposes.
fr: La seule communication externe se fait avec votre fournisseur d'identité configuré à des fins d'authentification.

source: Security Considerations
fr: Considérations de sécurité

source: Use only <strong>test accounts</strong>, not real user accounts
fr: Utilisez uniquement des <strong>comptes de test</strong>, pas de vrais comptes utilisateurs

source: Do not use sensitive or production data
fr: N'utilisez pas de données sensibles ou de production

source: Ensure your deployment is properly secured (HTTPS, firewall, etc.)
fr: Assurez-vous que votre déploiement est correctement sécurisé (HTTPS, pare-feu, etc.)

source: Change the default
fr: Changez la valeur par défaut de la

source: environment variable
fr: variable d'environnement

source: Your Rights
fr: Vos droits

source: You can review the source code to understand data handling
fr: Vous pouvez examiner le code source pour comprendre la gestion des données

source: You can modify the application to suit your needs
fr: Vous pouvez modifier l'application pour répondre à vos besoins

source: Identity Provider's Privacy Policy
fr: Politique de confidentialité du fournisseur d'identité

source: Your identity provider may have its own privacy policy regarding the data they collect and share. Please review their privacy policy for information about how they handle your data.
fr: Votre fournisseur d'identité peut avoir sa propre politique de confidentialité concernant les données qu'il collecte et partage. Veuillez consulter sa politique de confidentialité pour des informations sur la façon dont il gère vos données.

source: Server specifications
fr: Spécifications du serveur

source: Supported specifications (%(count)s)
fr: Spécifications supportées (%(count)s)

source: Unsupported specifications (%(count)s)
fr: Spécifications non supportées (%(count)s)

source: Unknown specifications (%(count)s)
fr: Spécifications inconnues (%(count)s)

source: Server Specifications
fr: Spécifications du serveur

source: Static configuration
fr: Configuration statique

source: If you prefer to configure Auth Playground via environment variables without validating the server first, you can set them directly and restart the application.
fr: Si vous préférez configurer Auth Playground via des variables d'environnement sans valider d'abord le serveur, vous pouvez les définir directement et redémarrer l'application.

source: Create an OAuth client on your provider
fr: Créer un client OAuth sur votre fournisseur

source: What configuration details do I need?
fr: Quels détails de configuration ai-je besoin ?

source: Configure these URIs in your OAuth client:
fr: Configurez ces URIs dans votre client OAuth :

source: Set the following environment variables in a
fr: Définissez les variables d'environnement suivantes dans un fichier

source: file or by exporting them in your shell:
fr: ou en les exportant dans votre shell :

source: Restart the application
fr: Redémarrez l'application

source: Purpose
fr: Objectif

source: Auth Playground is an <strong>educational and demonstration tool</strong> designed to help developers test OAuth2 and OpenID Connect (OIDC) authentication flows. It is intended for:
fr: Auth Playground est un <strong>outil éducatif et de démonstration</strong> conçu pour aider les développeurs à tester les flux d'authentification OAuth2 et OpenID Connect (OIDC). Il est destiné à :

source: Learning and understanding OAuth 2.0 and OpenID Connect protocols
fr: Apprendre et comprendre les protocoles OAuth 2.0 et OpenID Connect

source: Testing integration with identity providers
fr: Tester l'intégration avec les fournisseurs d'identité

source: Demonstrating authentication flows in development environments
fr: Démontrer les flux d'authentification dans les environnements de développement

source: Debugging OIDC implementations
fr: Déboguer les implémentations OIDC

source: Open Source Project
fr: Projet open source

source: Auth Playground is an open source project. You are free to:
fr: Auth Playground est un projet open source. Vous êtes libre de :

source: Use, modify, and distribute the software
fr: Utiliser, modifier et distribuer le logiciel

source: Self-host the application
fr: Auto-héberger l'application

source: Contribute improvements and bug fixes
fr: Contribuer des améliorations et des corrections de bugs

source: Review the source code for security and functionality
fr: Examiner le code source pour la sécurité et les fonctionnalités

source: Please refer to the LICENSE file in the repository for detailed terms.
fr: Veuillez vous référer au fichier LICENSE dans le dépôt pour les conditions détaillées.

source: User Responsibility
fr: Responsabilité de l'utilisateur

source: When using Auth Playground, you are responsible for:
fr: Lorsque vous utilisez Auth Playground, vous êtes responsable de :

source: Using only test accounts and non-sensitive data
fr: Utiliser uniquement des comptes de test et des données non sensibles

source: Securing your deployment appropriately for your environment
fr: Sécuriser votre déploiement de manière appropriée pour votre environnement

source: Configuring environment variables correctly
fr: Configurer correctement les variables d'environnement

source: Understanding the security implications of your setup
fr: Comprendre les implications de sécurité de votre configuration

source: Complying with your identity provider's terms of service
fr: Respecter les conditions d'utilisation de votre fournisseur d'identité

source: No Warranty
fr: Aucune garantie

source: This software is provided "as is" without warranty of any kind, express or implied. Use at your own risk.
fr: Ce logiciel est fourni « en l'état » sans garantie d'aucune sorte, expresse ou implicite. Utilisez-le à vos propres risques.
