Repository: pypi-data/pypi-mirror-401
Catalog: packages/django-dynamic-workflows/django_dynamic_workflows-1.6.0.tar.gz/django_dynamic_workflows-1.6.0/django_workflow_engine/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Role-based Approval
ar: موافقة قائمة على الدور

source: User-specific Approval
ar: موافقة خاصة بالمستخدم

source: Self Approval
ar: موافقة ذاتية

source: Team Head Approval
ar: موافقة رئيس الفريق

source: Department Head Approval
ar: موافقة رئيس القسم

source: Any user with role can approve
ar: أي مستخدم لديه الدور يمكنه الموافقة

source: All users with role must approve
ar: يجب أن توافق عليه جميع المستخدمين الذين لديهم الدور

source: Rotate approval among role users
ar: تدوير الموافقة بين مستخدمي الدور

source: Workflow Approved
ar: تمت الموافقة على سير العمل

source: Workflow Rejected
ar: تم رفض سير العمل

source: Workflow Update
ar: تحديث سير العمل

source: No workflow attached to this object
ar: لا يوجد سير عمل مرفق بهذا الكائن

source: Workflow is not in progress
ar: سير العمل ليس قيد التقدم

source: Reason is required for rejection
ar: السبب مطلوب للرفض

source: Reason is required for resubmission
ar: السبب مطلوب لإعادة التقديم

source: Stage
ar: المرحلة

source: Pipeline
ar: خط الأنابيب

source: Active
ar: نشط

source: Inactive
ar: غير نشط

source: Completed
ar: مكتمل

source: In Progress
ar: قيد التقدم

source: Not Started
ar: لم يبدأ

source: Rejected
ar: مرفوض

source: Cancelled
ar: ملغي

source: Pending Approval
ar: في انتظار الموافقة

source: Approved
ar: تمت الموافقة

source: Delegated
ar: مفوض

source: Needs Resubmission
ar: يتطلب إعادة التقديم

source: Action '{action_name}' is not registered
ar: الإجراء '{action_name}' غير مسجل

source: Execution of action '{action_name}' failed: {error}
ar: فشل تنفيذ الإجراء '{action_name}': {error}

source: Workflow created - ID: {workflow_id}, Name: {name}
ar: تم إنشاء سير العمل - المعرف: {workflow_id}، الاسم: {name}

source: Workflow started for {obj_label}({obj_pk})
ar: تم بدء سير العمل لـ {obj_label}({obj_pk})

source: Workflow completed for {obj_label}({obj_pk})
ar: تم إكمال سير العمل لـ {obj_label}({obj_pk})

source: Stage '{stage}' approved for {obj_label}({obj_pk})
ar: تمت الموافقة على المرحلة '{stage}' لـ {obj_label}({obj_pk})

source: Stage '{stage}' rejected for {obj_label}({obj_pk})
ar: تم رفض المرحلة '{stage}' لـ {obj_label}({obj_pk})

source: Moved to next stage '{stage}' for {obj_label}({obj_pk})
ar: تم النقل إلى المرحلة التالية '{stage}' لـ {obj_label}({obj_pk})
