# Python
ms-python.black-formatter
ms-python.isort
ms-python.python
ms-python.vscode-pylance
njpwerner.autodocstring

# Git
seatonjiang.gitmoji-vscode
GitHub.vscode-pull-request-github
GitHub.vscode-github-actions

# Writing
yzhang.markdown-all-in-one
bierner.markdown-preview-github-styles
DavidAnson.vscode-markdownlint
streetsidesoftware.code-spell-checker
aaron-bond.better-comments

# Support languages
tamasfe.even-better-toml
redhat.vscode-yaml
samuelcolvin.jinjahtml
bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting

# Utilities
quicktype.quicktype
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.live-server
ms-vsliveshare.vsliveshare
jock.svg

# Productivity
GitHub.copilot
GitHub.copilot-chat
alefragnani.bookmarks
