Repository: pypi-data/pypi-mirror-401
Catalog: packages/imio.annex/imio_annex-2.27.1-py3-none-any.whl/imio/annex/locales/*/LC_MESSAGES/imio.annex.po
Languages: fr

source: Annex
fr: Annexe

source: Annex types
fr: Types d'annexe

source: Apply the first category on all elements
fr: Appliquer la première catégorie à l'ensemble des éléments

source: File
fr: Fichier

source: Nothing to export.
fr: Rien à exporter.

source: Title
fr: Titre

source: Two-sided?
fr: Pour impression recto-verso?

source: concatenate_annexes_pdf_read_error
fr: Erreur lors de l'exportation du fichier PDF, format PDF incorrect pour l'annexe "${annex_title}" de l'élément "${obj_title}"!

source: concatenate_annexes_pdf_too_large_error
fr: Erreur lors de l'exportation du fichier PDF, la taille des annexes sélectionnées est de ${total_size} mais la taille maximale est de ${max_total_size}!

source: descr_two_sided
fr: Si le document PDF généré est destiné à être imprimé, une page blanche sera insérée pour que le nombre de pages par annexe soit toujours pair.
