Repository: pypi-data/pypi-mirror-401
Catalog: packages/imio.pm.wsclient/imio_pm_wsclient-2.0.6.tar.gz/imio_pm_wsclient-2.0.6/src/imio/pm/wsclient/locales/*/LC_MESSAGES/imio.pm.wsclient.po
Languages: fr

source: A filename is mandatory while generating a document! Please contact system administrator!
fr: Un nom de fichier est obligatoire pour générer un document! Contactez votre administrateur sytème!

source: Actions to send an item to PloneMeeting can be generated. First enter a 'TAL condition' evaluated to show the action then choose permission(s) the user must have to see the action. Finally, choose the meetingConfig the item will be sent to.
fr: Des actions pour faciliter l'envoi d'un point vers iA.Delib peuvent être générées. Elle apparaîtront par défaut dans la liste déroulante 'Actions'. Vous pouvez définir une 'Expression au format TAL' et choisir une 'Permission' pour protéger l'action. Pour finir, définissez dans quelle configuration de séance le point correspondant sera créé.

source: Allowed annex type
fr: Type d'annexe

source: Allowed annexes types
fr: Types autorisés d'annexe

source: An annex id is mandatory to download an annex!
fr: Un id d'annexe est obligatoire pour la downloader!

source: An element can be sent one time only
fr: Un élément ne peut être envoyé qu'une seule fois

source: An error occured during the item creation in PloneMeeting! The error message was : ${error}
fr: Une erreur est survenue lors de l'envoi vers iA.Delib! L'erreur est : ${error}

source: An error occured during the item creation in PloneMeeting! The error message was : [{'field': 'proposingGroup', 'message': u'Proposing group is not available for user.', 'error': 'ValidationError'}]
fr: Une erreur s'est produite durant la création d'un point! Le message d'erreur est : [{'field': 'proposingGroup', 'message': u'Proposing group is not available for user.', 'error': 'ValidationError'}]

source: An error occured while generating the document in PloneMeeting! The error message was : %s
fr: Une erreur s'est produite durant la génération du document! Le message d'erreur est : %s

source: An error occured while searching for linked items in PloneMeeting! The error message was : %s
fr: Une erreur s'est produite lors de la recherche des points liés! Le message d'erreur est : %s

source: Annex type
fr: Type d'annexe

source: By default, while sending an element to PloneMeeting, the user id of the logged in user is used and a binding is made to the same user id in PloneMeeting. If the local user id does not exist in PloneMeeting, you can define here the user mappings to use. For example : 'jdoe' in 'Local user id' of the current application correspond to 'johndoe' in PloneMeeting.
fr: Par défaut lors de l'envoi d'un point vers iA.Delib, le nom d'utilisateur de l'utilisateur couramment connecté est utilisé. Si le nom d'utilisteur local est différent du nom d'utilisateur dans iA.Delib, vous pouvez les définir ci-dessous. Par exemple 'jdoe' dans l'application courante a un utilisateur correspondant 'johndoe' dans iA.Delib.

source: Cancel
fr: Annuler

source: Changes saved
fr: Changements appliqués

source: Could not detect correct mimetype for item template! Please contact system administrator!
fr: Impossible de détecter le type MIME pour le document à générer! Contactez votre administrateur système!

source: Could not get userInfos in PloneMeeting for user '${userId}'!
fr: Impossible d'obtenir des informations sur l'utilisateur '${userId}' dans iA.Delib!

source: Edit cancelled
fr: Édition annulée

source: Enter a TAL expression that will be evaluated to check if the viewlet displaying informations about the created items in PloneMeeting should be displayed. If empty, the viewlet will only be displayed if an item is actually linked to it. The 'isLinked' variable representing this default behaviour is available in the TAL expression.
fr: Entrez une expression au format TAL qui sera évaluée pour vérifier si le viewlet affichant les informations dans iA.Delib doit être montré ou non. Par défaut, si aucune expression n'est entrée ci-dessous, le viewlet sera montré s'il y a effectivement un point correspondant dans iA.Delib. La variable 'isLinked' est disponible pour l'expression TAL.

source: Enter the timeout while connecting to PloneMeeting. Do not set a too high timeout because it will impact the load of the viewlet showing PM infos on a sent element if PM is not available. Default is '10' seconds.
fr: Entrez le timeout de connexion à iA.Delib. Attention, ne pas mettre une valeurs trop importe car si iA.Delib n'est pas disponible, cela influera sur la vitesse d'affichage d'une page dans laquelle le viewlet affichant les infos iA.Delib est montré.

source: Field accessor mappings
fr: Correspondances pour les champs

source: Field mappings
fr: Correspondances des champs

source: For every available data you can send, define in the mapping a TAL expression that will be executed to obtain the correct value to send. The 'meetingConfigId' and 'proposingGroupId' variables are also available for the expression. Special case for the 'proposingGroup' and 'category' fields, you can 'force' the use of a particular value by defining it here. If not defined the user will be able to use every 'proposingGroup' or 'category' he is allowed to use in PloneMeeting.
fr: Pour chaque données à envoyer, définissez une expression TAL qui fait correspondre à l'élément à envoyer, la valeur à utiliser pour un champ dans iA.Delib. Les variables 'meetingConfigId' et 'proposingGroupId' sont disponibles pour l'expression TAL. Pour les champs 'proposingGroup' et 'category', si vous définissez une valeur ici, cela 'forcera' l'utilisation de ces valeurs. Sinon l'utilisateur pourra utiluser les 'groupes proposants' et 'catégories' qu'il peut habituellement utiliser dans iA.Delib.

source: Generated actions
fr: Actions générées

source: List here the annexes types allowed to be display in the linked meeting item viewlet
fr: Lister ici les types d'annexes autorisés à l'affichage de la séance liée

source: Local user id
fr: Nom d'utilisateur local

source: Meeting config id
fr: Identifiant séance

source: No configuration informations found!
fr: Aucune information de configuration n'a été trouvée dans iA.Delib!

source: No field_mappings defined in the WS4PMClient configuration!
fr: Aucune correspondance de champs définie dans la configuration des webservices iA.Delib!

source: No sufficient field mappings are defined in the configuration. It is recommended to define at least the 'title' mapping, but 'description' and 'decision' should also be defined. It will ne be possible to create the item in PloneMeeting.
fr: Les 'Correspondances pour les champs' définies dans la configuration ne sont pas suffisantes. Le champ 'title' doit être défini et idéalement, les champs 'description' et 'decision' également. Le point ne pourra pas être créé.

source: PloneMeeting URL
fr: URL de la gestion des séances

source: PloneMeeting connection timeout
fr: Timeout de connexion à iA.Delib

source: PloneMeeting corresponding user id
fr: Nom d'utilisateur correspondant dans iA.Delib

source: PloneMeeting field name
fr: Nom du champ dans iA.Delib

source: PloneMeeting informations
fr: Informations provenant de iA.Delib

source: PloneMeeting meetingConfig id
fr: Identifiant de configuration de séance dans iA.Delib

source: PloneMeeting password to use
fr: Mot de passe à utiliser dans iA.Delib

source: PloneMeeting username to use
fr: Nom d'utilisateur à utiliser dans iA.Delib

source: Save
fr: Enregistrer

source: Select all attachments by default
fr: Sélectionner par défaut toutes les annexes

source: Select the annexes to send
fr: Sélectionnez les annexes à envoyer

source: Select the category to use for the created item item in PloneMeeting
fr: Sélectionnez la catégorie avec laquelle le point sera créé dans iA.Delib

source: Select the desired meeting date for the created item in PloneMeeting
fr: Sélectionnez la date de séance souhaitée

source: Select the proposing group to use for the created item in PloneMeeting
fr: Sélectionnez le groupe proposant avec lequel le point sera créé dans iA.Delib

source: Send
fr: Envoyer

source: Send to ${meetingConfigTitle}
fr: Envoyer vers ${meetingConfigTitle}

source: Send to PloneMeeting
fr: Envoyer vers iA.Delib

source: TAL Condition
fr: Condition au format TAL

source: TAL expression to evaluate for the corresponding PloneMeeting field name
fr: Expression TAL à évaluer pour le champ iA.Delib correspondant

source: The current user can not create an item with the category forced thru the configuration! Please contact system administrator!
fr: L'utilisateur courant ne peut créer de point avec la catégorie forcée dans la configuration! Contactez votre administrateur système!

source: The current user can not create an item with the proposingGroup forced thru the configuration! Please contact system administrator!
fr: L'utilisateur courant ne peut créer de point pour le groupe proposant forcé par la configuration! Contactez votre administrateur système!

source: The item has been correctly sent to PloneMeeting.
fr: L'élément a été correctement envoyé vers iA.Delib.

source: The requested file could not be found on the item
fr: Le fichier demandé ne peut être trouvé sur le point

source: The user must be at least a 'MeetingManager'. Nevertheless, items will be created regarding the <i>User ids mappings</i> defined here under.
fr: L'utilisateur renseigné doit être au moins 'MeetingManager'. Néanmoins, les points créés dans iA.Delib le seront en fonction de ce qui est défini dans le champ 'Correspondance pour les utilisateurs' ci-dessous.

source: There was NO WARNING message during item creation.
fr: Il n'y a pas eu de message d'avertissement durant la création du point.

source: There was an error evaluating the TAL expression '${expr}' for the field '${field_name}'! The error was : ${error}. Please contact system administrator.
fr: Une erreur s'est produite lors de l'évaluation de l'expression TAL '${expr} pour le champ '${field_name}'! L'erreur est : ${error}. Contactez votre administrateur système.

source: This element has already been sent to PloneMeeting!
fr: Cet élément a déjà été envoyé vers iA.Delib!

source: This element is linked to item(s) in PloneMeeting but your are not allowed to see it.
fr: Cet élément est lié à un(des) point(s) dans iA.Delib mais vous n'avez pas l'autorisation des le(s) voir.

source: Unable to connect to PloneMeeting! Please contact system administrator!
fr: Impossible de se connecter à iA.Delib! Contactez votre administrateur système!

source: Unable to connect to PloneMeeting! The error message was : ${error}!
fr: Impossible de se connecter à iA.Delib! Le message d'erreur est : ${error}!

source: Unable to display informations about the potentially linked item in PloneMeeting because there was an error evaluating the TAL expression '${expr}' for the field '${field_name}'! The error was : '${error}'. Please contact system administrator.
fr: Impossible de montrer le viewlet affichant les informations liées dans PloneMeeting car il y a une erreur dans l'expression TAL liée à la condition d'affichage du viewlet. Contactez votre administrateur système!

source: User ids mappings
fr: Correspondances pour les nom d'utilisateurs

source: User mappings
fr: Correspondances d'utilisateur

source: Viewlet display condition
fr: Condition d'affichage du viewlet

source: WS4PM Client settings
fr: Client webservices iA.Delib

source: When enabled, all attachments are selected by default. Users can still manually deselect individual attachments if needed.
fr: Si coché, toutes les annexes sont sélectionnées par défaut. L'utilisateur peut cependant désélectionner chaque annexe individuellement.

source: pm_informations_help
fr: Vous voyez ces informations car cet élément a été envoyé vers iA.delib.

source: send_to_plonemeeting_descr
fr: Voici un résumé de ce qui va être envoyé
