Repository: pypi-data/pypi-mirror-401
Catalog: packages/betty/betty-0.4.37.tar.gz/betty-0.4.37/betty/assets/locale/*/betty.po
Languages: de_de, ru_ru

source: Person name
de_de: Name der Person
ru_ru: Имя

source: Person names
de_de: Namen der Personen
ru_ru: Имена

source: Place
de_de: Ort
ru_ru: Место

source: Places
de_de: Orte
ru_ru: Места

source: Plugin {plugin_label} ({plugin_id}) is not configurable, but configuration was given.
ru_ru: Расширение {plugin_label} ({plugin_id}) не настраиваемое, но настройка была задана.

source: Presence
de_de: Anwesenheit
ru_ru: Присутствие

source: Presence of {person} at {event}
de_de: Anwesenheit von {person} zum {event}
ru_ru: Присутствие {person} на {event}

source: Presences
de_de: Anwesenheiten
ru_ru: Присутствия

source: Privatized person {privatized_person_id} ({privatized_person}) because they are likely still alive.
de_de: Privatisierte Person {privatized_person_id} ({privatized_person}), da sie wahrscheinlich noch am Leben ist.
ru_ru: Скрыт человек {privatized_person_id} ({privatized_person}), потому что он, вероятно, все еще жив.

source: Privatized place {privatized_place_id} ({privatized_place}) because it is not associated with any public information.
ru_ru: Скрыто место {privatized_place_id} ({privatized_place}), поскольку оно не связано с какой-либо общедоступной информацией.

source: Privatized {count} people because they are likely still alive.
de_de: Privatisierte {count} Personen, weil sie wahrscheinlich noch am Leben sind.
ru_ru: Скрыто {count} человек, потому что они, вероятно, все еще живы.

source: Privatized {count} {entity_type}, because they are associated with private information.
ru_ru: Скрыто {count} объектов типа {entity_type}, поскольку они связаны с личной информацией.

source: Privatized {privatized_entity_type} {privatized_entity_id} ({privatized_entity}) because of {reason_entity_type} {reason_entity_id} ({reason_entity}).
de_de: Privatisierte {privatized_entity_type} {privatized_entity_id} ({privatized_entity}) weil {reason_entity_type} {reason_entity_id} ({reason_entity}).
ru_ru: Скрыто {privatized_entity_type} {privatized_entity_id} ({privatized_entity}) поскольку скрыто {reason_entity_type} {reason_entity_id} ({reason_entity}).

source: Privatizer
de_de: Privatisierer
ru_ru: Маскиратор

source: Privatizing...
de_de: Privatisieren...
ru_ru: Сокрытие личной информации...

source: Project author
de_de: Projektautor
ru_ru: Автор проекта

source: Province
de_de: Provinz
ru_ru: Провинция

source: Public domain
de_de: Gemeinfrei
ru_ru: Публичный домен

source: Read more
de_de: Mehr lesen
ru_ru: Подробнее

source: Read more on Wikipedia.
de_de: Lies mehr auf Wikipedia.
ru_ru: Подробнее на Wikipedia.

source: Read the Betty documentation
de_de: Lese die Betty-Dokumentation
ru_ru: Ознакомьтесь с документацией Betty

source: References
de_de: Referenzen
ru_ru: Ссылки

source: Region
ru_ru: Регион

source: Reset
de_de: Zurücksetzen
ru_ru: Сброс

source: Residence
de_de: Wohnort
ru_ru: Проживание

source: Results ({{{ betty-search-results-count }}})
de_de: Ergebnisse ({{{ betty-search-results-count }}})
ru_ru: Найдено ({{{ betty-search-results-count }}})

source: Retirement
de_de: Ruhestand
ru_ru: Выход на пенсию

source: Saved your project to {configuration_file}.
ru_ru: Проект сохранен в {configuration_file}.

source: Search
de_de: Suchen
ru_ru: Поиск

source: Serve a generated site
ru_ru: Запустить созданный сайт

source: Serving your site at {url}...
de_de: Auslieferung deiner Seite unter {url}...
ru_ru: Сайт доступен по адресу {url}...

source: Source
de_de: Quelle
ru_ru: Хранилище

source: Sources
de_de: Quellen
ru_ru: Источники

source: Speaker
de_de: Sprecher
ru_ru: Выступавший

source: Starting Python's built-in web server...
de_de: Starte Pythons eingebauten Webserver...
ru_ru: Запуск встроенного веб-сервера Python...

source: State
de_de: Staat
ru_ru: Штат

source: Street
de_de: Straße
ru_ru: Улица

source: Subject
de_de: Betreff
ru_ru: Тема

source: Subjects
de_de: Betreffe
ru_ru: Субъекты

source: The '%(project_title)s' logo
de_de: Das Logo von '%(project_title)s'
ru_ru: Логотип проекта '%(project_title)s'

source: The Gramps {gramps_entity_reference} entity has a "betty:link-{link_name}:media_type" attribute with value "{media_type}", which is not a valid IANA media type. This media type was ignored.
ru_ru: Объект Gramps {gramps_entity_reference} имеет атрибут "betty:link-{link_name}:media_type" со значением "{media_type}", который не является допустимым типом медиа IANA. Этот тип медиа был проигнорирован.

source: The Gramps {gramps_entity_reference} entity requires a "betty:link-{link_name}:url" attribute. This link was ignored.
ru_ru: Для объекта Gramps {gramps_entity_reference} требуется атрибут "betty:link-{link_name}:url". Эта ссылка была проигнорирована.

source: The URL must include a host.
ru_ru: URL-адрес должен содержать имя хоста.

source: The URL must start with a scheme such as https:// or http://.
de_de: Die URL muss mit einem Schema, wie https://, oder http:// starten.
ru_ru: URL-адрес должен начинаться с указания протокола https:// или http://.

source: The betty:privacy Gramps attribute must have a value of "public" or "private", but "{privacy_value}" was given for {entity_type} {entity_id} ({entity_label}), which was ignored.
de_de: Das betty:privacy Gramps-Attribut muss einen Wert von "public" oder "private" haben, aber "{privacy_value}" wurde für {entity_type} {entity_id} ({entity_label}) angegeben, was ignoriert wurde.
ru_ru: Атрибут Gramps betty:privacy должен иметь значение "public" или "private", но для {entity_type} {entity_id} ({entity_label}) было указано "{privacy_value}", которое было проигнорировано.

source: The entity reference must be for an entity of type {expected_entity_type_id}, but instead does not specify an entity type at all.
de_de: Die Entitätsreferenz muss für eine Entität des Typs {expected_entity_type_id} sein, gibt aber stattdessen überhaupt keinen Entitätstyp an.
ru_ru: Ссылка на объект должна относиться к объекту типа {expected_entity_type_id}, но вместо этого вообще не указывает тип объекта.

source: The entity reference must be for an entity of type {expected_entity_type_id}, but instead is for an entity of type {actual_entity_type_id}.
de_de: Die Entitätsreferenz muss für eine Entität vom Typ {expected_entity_type_id} sein, ist aber stattdessen für eine Entität vom Typ {actual_entity_type_id}.
ru_ru: Ссылка на объект должна относиться к объекту типа {expected_entity_type_id}, но вместо этого она относится к объекту типа {actual_entity_type_id}.

source: The following errors occurred
de_de: Die folgenden Fehler sind aufgetreten
ru_ru: Произошли следующие ошибки

source: The server at {url} was unreachable after starting.
ru_ru: Сервер по адресу {url} остался недоступным после запуска.

source: There are no available options.
de_de: Es sind keine Optionen verfügbar.
ru_ru: Доступные варианты отсутствуют.

source: They are the child of %(parent_labels)s.
de_de: Die Eltern sind %(parent_labels)s.
ru_ru: Они дети %(parent_labels)s.

source: They grew up with a sibling.
de_de: Er oder sie ist mit einem Geschwisterkinder aufgewachsen.
ru_ru: У них было %(sibling_count)s брат и сестра.

source: They had a child with %(co_parent_labels)s.
de_de: Er oder sie hatte ein Kind mit %(co_parent_labels)s.
ru_ru: У них с %(co_parent_labels)s был один ребенок.

source: They had a child.
de_de: Er oder sie hatte ein Kind.
ru_ru: У них был %(child_count)s ребенок.

source: This citation's details are unavailable to protect people's privacy.
ru_ru: Подробности этой цитаты скрыты в целях защиты личных данных.

source: This field is required.
de_de: Diese Feld ist erforderlich.
ru_ru: Это поле является обязательным.

source: This information is unavailable to protect people's privacy.
ru_ru: Эта информация скрыта в целях защиты личных данных.

source: This is not valid Gramps XML.
ru_ru: Это недопустимый файл XML Gramps.

source: This must be a boolean.
de_de: Es muss ein Boolean sein.
ru_ru: Это должно быть логическое значение.

source: This must be a decimal number.
de_de: Es muss eine Dezimalzahl sein.
ru_ru: Это должно быть десятичное число.

source: This must be a key-value mapping.
de_de: Es muss ein Key-Value Paar sein.
ru_ru: Это должна быть пара ключ-значение.

source: This must be a positive number.
de_de: Es muss einen positive Zahl sein.
ru_ru: Это должно быть положительное число.

source: This must be a sequence.
de_de: Dies muss eine Sequenz sein.
ru_ru: Это должна быть последовательность.

source: This must be a string.
de_de: Es muss ein Text-String sein.
ru_ru: Это должна быть строка.

source: This must be a whole number.
de_de: Es muss eine ganze Zahl sein.
ru_ru: Это должно быть целое число.

source: This must be none/null.
de_de: Es muss None/Null sein.
ru_ru: Это должно быть значение none/null.

source: This person's details are unavailable to protect their privacy.
de_de: Die Angaben zu dieser Person sind zum Schutz ihrer Privatsphäre nicht verfügbar.
ru_ru: Подробности об этом человеке скрыты в целях защиты личных данных.

source: This person's name is unavailable to protect their privacy.
de_de: Der Name dieser Person ist zum Schutz ihrer Privatsphäre nicht verfügbar.
ru_ru: Имя этого человека скрыто в целях защиты личных данных.

source: This person's name is unknown.
de_de: Der Name dieser Person ist nicht bekannt.
ru_ru: Имя неизвестно.

source: This source's details are unavailable to protect people's privacy.
ru_ru: Информация из этого источника скрыта в целях защиты личных данных.

source: Timeline
de_de: Zeitschiene
ru_ru: Хронология

source: Toggle full screen
de_de: Vollbild umschalten
ru_ru: Переключить режим отображения

source: Town
de_de: Stadt
ru_ru: Городок

source: Trees
de_de: Bäume
ru_ru: Древа

source: Unauthorized
de_de: Unberechtigt
ru_ru: Неавторизован

source: Unknown
de_de: Unbekannt
ru_ru: Неизвестно

source: Unknown file format "{extension}". Supported formats are: {available_formats}.
de_de: Unbekanntes Dateiformat "{extension}". Unterstützte Formate sind: {available_formats}.
ru_ru: Неизвестный формат файла "{extension}". Поддерживаемые форматы: {available_formats}.

source: Unknown key: {unknown_key}.
de_de: Unbekannter Schlüssel: {unknown_key}.
ru_ru: Неизвестный ключ: {unknown_key}.

source: Update all existing translations
de_de: Alle vorhandenen Übersetzungen aktualisieren
ru_ru: Обновление всех существующих переводов

source: Update all existing translations for Betty itself
de_de: Alle vorhandenen Übersetzungen für Betty selbst aktualisieren
ru_ru: Обновление всех собственных существующих переводов Betty

source: Update all existing translations for an extension
de_de: Alle vorhandenen Übersetzungen für eine Erweiterung aktualisieren
ru_ru: Обновление всех существующих переводов расширения

source: Updated {updated_derivations} {event_type} events based on existing information.
de_de: Aktualisierte {updated_derivations} {event_type} Ereignisse auf Grund existierender Informationen.
ru_ru: Обновлено {updated_derivations} событий типа {event_type} на основе существующей информации.

source: Use <kbd>↑</kbd> and <kbd>↓</kbd> to navigate results, or <kbd>esc</kbd> to exit the search.
de_de: Nimm <kbd>↑</kbd> und <kbd>↓</kbd> um zwischen den Ergebnissen zu navigieren oder <kbd>esc</kbd> um die Suche zu verlassen.
ru_ru: Используйте <kbd>↑</kbd> и <kbd>↓</kbd> для навигации по результатам или <kbd>esc</kbd> для завершения поиска.

source: View original
de_de: Original ansehen
ru_ru: Посмотреть оригинал

source: View the documentation
ru_ru: Просмотреть документацию

source: Village
de_de: Dorf
ru_ru: Село

source: Welcome to %(project_title)s
de_de: Willkommen zu %(project_title)s
ru_ru: Добро пожаловать в %(project_title)s

source: What is the path to your exported Gramps family tree file?
ru_ru: Каков путь к вашему экспортированному файлу семейного древа Gramps?

source: What is the project author called in {locale}?
ru_ru: Как называется автор проекта для языка {locale}?

source: What is your project called in {locale}?
ru_ru: Как называется ваш проект на языке {locale}?

source: What is your project's machine name?
ru_ru: Каково машиночитаемое имя вашего проекта?

source: Where do you want to save your project's configuration file?
ru_ru: Где вы хотите сохранить конфигурационный файл вашего проекта?

source: Which language should your project site be generated in? Enter an IETF BCP 47 language code.
ru_ru: На каком языке должен быть создан сайт вашего проекта? Введите код языка IETF BCP 47.

source: Wikipedia
ru_ru: Википедия

source: Wikipedia contributors
de_de: Wikipedia-Mitwirkende
ru_ru: Участники Wikipedia

source: Will
de_de: Wille
ru_ru: Завещание

source: Witness
de_de: Zeuge
ru_ru: Свидетель

source: Witnesses
de_de: Zeugen
ru_ru: Свидетели

source: Works in the public domain can be used or referenced without permission, because nobody holds any exclusive rights over these works (anymore).
ru_ru: Произведения, находящиеся в общественном достоянии, которые можно использовать или на которые можно ссылаться без разрешения, поскольку (больше) никто не обладает никакими исключительными правами на эти произведения.

source: Your browser cannot show PDF documents. <a href="%(file_url)s">Download %(file_name)s</a> to view it on your device instead.
de_de: Dein Browser kann keine PDF-Dokumente anzeigen <a href="%(file_url)s">Late %(file_name)s</a> herunter, um sie auf deinem Gerät anzuzeigen.
ru_ru: Ваш браузер не может отображать документы PDF. <a href="%(file_url)s">Загрузите %(file_name)s</a> для просмотра его на своем устройстве.

source: Your project has no theme enabled. This means your site's pages may look bare. Try the "raspberry-mint" extension.
ru_ru: В вашем проекте не включена тема. Это означает, что страницы вашего сайта могут выглядеть пустыми. Попробуйте расширение "raspberry-mint".

source: Zoom in
ru_ru: Увеличить масштаб

source: Zoom out
ru_ru: Уменьшить масштаб

source: around {date}
de_de: um {date}
ru_ru: ~ {date}

source: from around {start_date}
de_de: von ungefähr {start_date}
ru_ru: с ~ {start_date}

source: from around {start_date} until around {end_date}
de_de: von ungefähr {start_date} bis um {end_date}
ru_ru: с ~ {start_date} до ~ {end_date}

source: from around {start_date} until sometime before around {end_date}
de_de: von ungefähr {start_date} bis irgendwann vor etwa {end_date}
ru_ru: когда-то в период между ~ {start_date} и ~ {end_date}

source: from around {start_date} until sometime before {end_date}
de_de: von etwa {start_date} bis irgendwann vor {end_date}
ru_ru: когда-то в период между ~ {start_date} и {end_date}

source: from around {start_date} until {end_date}
de_de: von etwa {start_date} bis {end_date}
ru_ru: с ~ {start_date} до {end_date}

source: from sometime after around {start_date} until around {end_date}
de_de: von etwa {start_date} bis etwa {end_date}
ru_ru: когда-то после периода между ~ {start_date} и ~ {end_date}

source: from sometime after around {start_date} until {end_date}
de_de: ab etwa {start_date} bis {end_date}
ru_ru: когда-то после периода между ~ {start_date} и {end_date}

source: from sometime after {start_date} until around {end_date}
de_de: von irgendwann nach {start_date} bis etwa {end_date}
ru_ru: когда-то после периода между {start_date} и ~ {end_date}

source: from sometime after {start_date} until {end_date}
de_de: von irgendwann nach {start_date} bis {end_date}
ru_ru: когда-то после периода между {start_date} и {end_date}

source: from {start_date}
de_de: ab {start_date}
ru_ru: c {start_date}

source: from {start_date} until around {end_date}
de_de: ab {start_date} bis etwa {end_date}
ru_ru: с {start_date} до ~ {end_date}

source: from {start_date} until sometime before around {end_date}
de_de: von {start_date} bis irgendwann vor etwa {end_date}
ru_ru: когда-то в период между {start_date} и ~ {end_date}

source: from {start_date} until sometime before {end_date}
de_de: ab etwa {start_date} bis {end_date}
ru_ru: когда-то в период между {start_date} и {end_date}

source: from {start_date} until {end_date}
de_de: von {start_date} bis {end_date}
ru_ru: с {start_date} до {end_date}

source: in %(place)s
ru_ru: в %(place)s

source: in %(source)s
ru_ru: в %(source)s

source: npm (https://www.npmjs.com/) must be available for features that require Node.js packages to be installed. Ensure that the `npm` executable is available in your `PATH`.
de_de: npm (https://www.npmjs.com/) muss installiert sein für Features, die installierte Node.js packages voraussetzen. Stelle sicher, dass das Programm `npm` in deinem `PATH` aufgeführt ist.
ru_ru: npm (https://www.npmjs.com/) должен быть доступен для функций, требующих установки пакетов Node.js. Убедитесь, что исполняемый файл "npm" доступен в вашем `PATH`.

source: npm is available
de_de: npm ist verfügbar
ru_ru: npm доступен

source: npm is not available
de_de: npm ist nicht verfügbar
ru_ru: npm не доступен

source: private
de_de: anonym
ru_ru: скрыто

source: show %(name_count)s more
de_de: zeige weitere %(name_count)s
ru_ru: показать еще %(name_count)s

source: show fewer
de_de: zeige weniger
ru_ru: показать меньше

source: show less
de_de: zeige weniger
ru_ru: свернуть

source: show more
de_de: zeige mehr
ru_ru: развернуть

source: sometime
de_de: irgendwann
ru_ru: когда-то

source: sometime after around {start_date}
de_de: irgendwann nach etwa {start_date}
ru_ru: когда-то после ~ {start_date}

source: sometime after {start_date}
de_de: einige Zeit nach {start_date}
ru_ru: когда-то после {start_date}

source: sometime before around {end_date}
de_de: etwas vor etwa {end_date}
ru_ru: когда-то до ~ {end_date}

source: sometime before {end_date}
de_de: etwas bevor {end_date}
ru_ru: когда-то до {end_date}

source: sometime between around {start_date} and around {end_date}
de_de: irgendwann zwischen {start_date} und etwa {end_date}
ru_ru: когда-то между ~ {start_date} и ~ {end_date}

source: sometime between around {start_date} and {end_date}
de_de: irgendwann zwischen {start_date} und {end_date}
ru_ru: когда-то между ~ {start_date} и {end_date}

source: sometime between {start_date} and around {end_date}
de_de: irgendwann zwischen {start_date} und etwa {end_date}
ru_ru: когда-то между {start_date} и ~ {end_date}

source: sometime between {start_date} and {end_date}
de_de: irgendwann zwischen {start_date} und {end_date}
ru_ru: когда-то между {start_date} и {end_date}

source: unknown date
de_de: unbekanntes Datum
ru_ru: дата неизвестна

source: until around {end_date}
de_de: bis um etwa {end_date}
ru_ru: до ~ {end_date}

source: until {end_date}
de_de: bis {end_date}
ru_ru: до {end_date}

source: y
ru_ru: y г.

source: {count} citation
ru_ru: {count} цитирование

source: {count} enclosure
ru_ru: {count} вложение

source: {count} entity
ru_ru: {count} объект

source: {count} event
de_de: {count} Ereignis
ru_ru: {count} событие

source: {count} file
de_de: {count} Datei
ru_ru: {count} файл

source: {count} file reference
ru_ru: {count} ссылка на файлы

source: {count} note
ru_ru: {count} заметка

source: {count} person
ru_ru: {count} человек

source: {count} person name
ru_ru: {count} имя

source: {count} place
de_de: {count} Ort
ru_ru: {count} место

source: {count} presence
ru_ru: {count} присутствовавший

source: {count} source
de_de: {count} Quelle
ru_ru: {count} источник

source: {dependent_label} requires {dependency_labels}.
de_de: {dependent_label} benötigt {dependency_labels}.
ru_ru: Для {dependent_label} требуется {dependency_labels}.

source: {event_type} of {subjects}
de_de: {event_type} von {subjects}
ru_ru: {event_type} {subjects}

source: {extension} does not have an assets directory.
ru_ru: У расширения {extension} отсутствует каталог ресурсов.

source: © Copyright the author, unless otherwise credited
ru_ru: © Авторские права принадлежат владельцу сайта, если не указано иное

source: © Copyright {author}, unless otherwise credited
de_de: © Copyright {author}, außer anders erwähnt
ru_ru: © Авторские права принадлежат {author}, если не указано иное
