Repository: pypi-data/pypi-mirror-401
Catalog: packages/betty/betty-0.4.37.tar.gz/betty-0.4.37/betty/assets/locale/*/betty.po
Languages: de_de, ru_ru

source: "{hex_value}" is not a valid hexadecimal color, such as #ffc0cb.
de_de: "{hex_value}" ist keine gültiger hexadezimaler Farbcode, so wie #ffc0cb.
ru_ru: «{hex_value}» не является допустимым шестнадцатеричным цветом, например #ffc0cb.

source: "{invalid_locale}" is not a valid IETF BCP 47 language tag.
de_de: "{invalid_locale}" ist kein gültiger IETF BCP 47 language tag.
ru_ru: «{invalid_locale}» не является допустимым языковым тегом IETF BCP 47.

source: "{path}" is not a directory.
de_de: "{path}" ist kein Verzeichnis.
ru_ru: «{path}» не является каталогом.

source: "{value}" is not a valid machine name: only lowercase letters, digits, and hyphens (-) are allowed.
ru_ru: {value} не является допустимым именем машины: разрешены только строчные буквы, цифры и дефисы (-).

source: %(date)s in %(place)s
ru_ru: %(date)s в %(place)s

source: %(event)s of %(subjects)s
de_de: %(event)s von %(subjects)s
ru_ru: %(event)s %(subjects)s

source: %(event)s with %(subjects)s
de_de: %(event)s mit %(subjects)s
ru_ru: %(event)s с %(subjects)s

source: %(person_individual_name)s had a child with %(co_parent_labels)s.
de_de: %(person_individual_name)s hat ein Kind mit %(co_parent_labels)s.
ru_ru: У %(person_individual_name)s был ребенок с %(co_parent_labels)s.

source: %(person_individual_name)s had a child.
de_de: %(person_individual_name)s hatte ein Kind.
ru_ru: У %(person_individual_name)s был ребенок.

source: %(person_individual_name)s is the child of %(parent_labels)s.
de_de: %(person_individual_name)s ist Kind von %(parent_labels)s.
ru_ru: %(person_individual_name)s - ребенок %(parent_labels)s.

source: A family history as told by <a href="https://betty.readthedocs.io">Betty👵</a>
de_de: Eine Familiengeschichte erzählt von <a href="https://betty.readthedocs.io">Betty👵</a>
ru_ru: Семейную историю рассказала <a href="https://betty.readthedocs.io">Betty👵</a>

source: API documentation
de_de: API Dokumentation
ru_ru: Документация API

source: About
de_de: Über
ru_ru: О программе

source: Access denied
de_de: Zugriff verweigert
ru_ru: Доступ запрещен

source: Accessed %(date)s
de_de: Zugriff %(date)s
ru_ru: Дата обращения: %(date)s

source: Adoption
ru_ru: Принятие

source: All caches cleared.
de_de: Alle Caches gelöscht.
ru_ru: Все кэши очищены.

source: All of these requirements must be met
de_de: Alle dieser Anforderungen müssen erfüllt sein
ru_ru: Все эти требования должны быть выполнены

source: All rights reserved
de_de: Alle Rechte vorbehalten
ru_ru: Все права защищены

source: Also known as %(names)s
de_de: Auch bekannt als %(names)s
ru_ru: Другие имена: %(names)s

source: Ancestral names include
de_de: Zu den Namen der Vorfahren gehören
ru_ru: Имена предков

source: Announcement of divorce
de_de: Ankündigung der Scheidung
ru_ru: Объявление о разводе

source: Announcement of marriage
de_de: Bekanntgabe der Eheschließung
ru_ru: Объявление о браке

source: Appearances
de_de: Erscheinungen
ru_ru: Источники

source: At least {expected} items are required, but found {actual}.
ru_ru: Требуется как минимум {expected} элементов, но найдено {actual}.

source: At most {expected} items are allowed, but found {actual}.
ru_ru: Разрешено не более {expected} элементов, но найдено {actual}.

source: At which URL will your site be published?
ru_ru: По какому адресу (URL) будет опубликован ваш сайт?

source: Attendee
de_de: Teilnehmer
ru_ru: Участники

source: Baptism
de_de: Taufe
ru_ru: Крещение

source: Bar mitzvah
de_de: Bar Mitzwa
ru_ru: Бар-мицва

source: Bat mitzvah
de_de: Bat Mitzwa
ru_ru: Бат-мицва

source: Beneficiary
de_de: Begünstigter
ru_ru: Бенефициары

source: Betty could not load the SPDX licenses
ru_ru: Betty не удалось загрузить лицензии SPDX

source: Betty is an application that takes a family tree and builds a website out of it, much like the one you are viewing right now. The more information your genealogical research contains, the more interactivity Betty can add to your site, such as media galleries, maps, and browsable family trees.
de_de: Betty ist eine Anwendung, die aus Familienstammbäumen Webseiten bauen kann, so ähnlich, wie diese Seite, die du dir gerade anschaust. Je mehr Information deine genealogische Forschung beinhaltet, desto mehr Interaktion kann Betty zu deiner Seite beitragen . Betty kann Medien-Gallerien, Karten und verlinkte Stammbäume erzeugen.
ru_ru: Betty - это приложение, которое использует семейное древо и создает на его основе веб-сайт, очень похожий на тот, который вы сейчас просматриваете. Чем больше информации содержит ваше генеалогическое исследование, тем больше интерактивности Бетти может добавить на ваш сайт, например, медиагалереи, карты и доступные для просмотра генеалогические древа.

source: Betty is unfamiliar with Gramps event "{event_id}"'s type of "{gramps_event_type}". The event was imported, but its type was set to "{betty_event_type}".
de_de: Betty ist mit dem Typ "{gramps_event_type}" von Gramps Ereignis "{event_id}" nicht vertraut. Das Ereignis wurde importiert, aber sein Typ wurde auf "{betty_event_type}" gesetzt.
ru_ru: Betty не знаком тип Gramps "{gramps_event_type}" для события "{event_id}". Событие было импортировано, но его тип был изменен на "{betty_event_type}".

source: Betty is unfamiliar with Gramps file "{file_id}"'s copyright notice ID of "{copyright_notice_id}" and ignored it.
ru_ru: Betty не знакома с идентификатором уведомления об авторских правах в файле Gramps "{file_id}" со значением "{copyright_notice_id}" и проигнорировала его.

source: Betty is unfamiliar with Gramps file "{file_id}"'s license ID of "{license_id}" and ignored it.
ru_ru: Betty не знакома с идентификатором лицензии файла Gramps "{file_id}" со значением "{license_id}" и проигнорировала его.

source: Betty is unfamiliar with Gramps place "{place_id}"'s type of "{gramps_place_type}". The place was imported, but its type was set to "{betty_place_type}".
ru_ru: Betty не знаком тип Gramps "{gramps_place_type}" для места "{place_id}". Место было импортировано, но его тип был изменен на "{betty_place_type}".

source: Betty is unfamiliar with person "{person_id}"'s Gramps presence role of "{gramps_presence_role}" for the event with Gramps handle "{event_handle}". The role was imported, but set to "{betty_presence_role}".
de_de: Betty kennt die Anwesenheitsrolle "{gramps_presence_role}" der Person "{person_id}" für das Ereignis mit dem Gramps-Handle "{event_handle}" nicht. Die Rolle wurde importiert, aber auf "{betty_presence_role}" gesetzt.
ru_ru: Betty не знакома роль присутствия Gramps "{gramps_presence_role}" человека "{person_id}" для события с идентификатором Gramps "{event_handle}". Роль была импортирована, но изменена на "{betty_presence_role}".

source: Betty was named after %(liberta_lankester_label)s, and this website shows a small sample of her family history. You can browse the pages about her and some of her family to get an idea of what a Betty site looks like.
de_de: Betty ist benannt nach %(liberta_lankester_label)s und diese Webseite zeigt einen kleinen Auszug aus ihrer Familiengeschichte. Du kannst die Seiten durchsuchen und so einen ersten Eindruck darüber gewinnen, was eine Betty Seite leisten kann.
ru_ru: Название Betty происходит от %(liberta_lankester_label)s, а этот вебсайт показывает небольшую часть ее семейной истории. Вы можете просмотреть страницы о ней и некоторых ее родственниках, чтобы получить представление о том, как выглядит сайт Betty.

source: Betty will talk to you in {locale}
ru_ru: Betty будет общаться с вами на языке {locale}

source: Birth
de_de: Geburt
ru_ru: Рождение

source: Borough
ru_ru: Боро

source: Building
de_de: Gebäude
ru_ru: Дом

source: Built the Webpack front-end assets.
de_de: Webpack front-end assets erstellt.
ru_ru: Созданы интерфейсные ресурсы Webpack.

source: Burial
de_de: Beerdigung
ru_ru: Погребение

source: Cannot find an available port to bind the web server to.
de_de: Es wurde kein verfügbarer Port gefunden, an den der Webserver gebunden werden kann.
ru_ru: Не удается найти доступный порт для веб-сервера.

source: Cannot find and import "{plugin_id}".
ru_ru: Не удается найти и импортировать "{plugin_id}".

source: Cannot find locale {locale}.
ru_ru: Не удается найти языковой стандарт {locale}.

source: Cannot generate pages for {entity_type}, because it is not a user-facing entity type.
de_de: Es können keine Seiten für {entity_type} erzeugt werden, da es sich nicht um einen benutzerorientierten Entitätstyp handelt.
ru_ru: Не удается создать страницы для {entity_type}, поскольку это не пользовательский тип объекта.

source: Cannot load Gramps file {file_id} with relative path {file_path}, because your family tree does not include a base path. In Gramps, add a "base path for relative media paths" to your family tree, and export it again.
ru_ru: Не удается загрузить файл Gramps {file_id} с относительным путем {file_path}, поскольку в вашем семейном древе отсутствует базовый путь. В Gramps добавьте "базовый путь для относительных путей к мультимедиа" к вашему семейному древу и экспортируйте его снова.

source: Cannot load Gramps file {file_id}, because {file_path} is not a file.
ru_ru: Не удается загрузить файл Gramps {file_id}, потому что {file_path} не является файлом.

source: Cannot load coordinates "{coordinates}", because they are in an unknown format.
de_de: Die Koordinaten "{coordinates}" können nicht geladen werden, da sie in einem unbekannten Format vorliegen.
ru_ru: Не удается загрузить координаты "{coordinates}", поскольку их формат неизвестен.

source: Celebrant
de_de: Zelebrant
ru_ru: Ведущий церемонии

source: Citation
de_de: Zitat
ru_ru: Цитата

source: Citations
de_de: Zitate
ru_ru: Цитаты

source: City
de_de: Großstadt
ru_ru: Город

source: Clear all caches
ru_ru: Очистить все кэши

source: Close
de_de: Schließen
ru_ru: Закрыть

source: Conference
de_de: Konferenz
ru_ru: Конференция

source: Configure Betty
de_de: Betty konfigurieren
ru_ru: Настройка Betty

source: Confirmation
de_de: Bestätigung
ru_ru: Миропомазание

source: Continue reading on <a href="%(url)s">Wikipedia</a>.
de_de: Auf <a href="%(url)s">Wikipedia</a> weiterlesen.
ru_ru: Продолжить чтение на <a href="%(url)s">Wikipedia</a>.

source: Copyright
de_de: Urheberrecht
ru_ru: Авторское право

source: Copyright <a href="%(url)s">OpenStreetMap</a> contributors
ru_ru: Авторские права принадлежат участникам <a href="%(url)s">OpenStreetMap</a>

source: Copyright Wikipedia contributors
ru_ru: Авторские права принадлежат участникам Wikipedia

source: Copyright of these works lies with the original authors who contributed them to Wikipedia.
ru_ru: Авторские права на эти работы принадлежат первоначальным авторам, которые разместили их в Wikipedia.

source: Correspondence
de_de: Schriftverkehr
ru_ru: Переписка

source: Cotton Candy is Betty's legacy theme.
ru_ru: Cotton Candy - это устаревшая тема Betty.

source: Could not extract {file_path} as a gzip file (*.gz).
de_de: Konnte {file_path} nicht als gzip (*.gz) Date extrahieren.
ru_ru: Не удалось распаковать {file_path} как файл gzip (*.gz).

source: Could not extract {file_path} as a gzipped tar file (*.tar.gz).
ru_ru: Не удалось распаковать {file_path} как сжатый файл tar (*.tar.gz).

source: Could not find a plugin "{plugin_id}".
ru_ru: Не удалось найти плагин "{plugin_id}".

source: Could not find any of the following configuration files in {project_directory_path}: {configuration_file_names}.
ru_ru: Не удалось найти ни одного из следующих файлов конфигурации в {project_directory_path}: {configuration_file_names}.

source: Could not find the file "{file_path}".
de_de: Konnte die Datei "{file_path}" nicht finden.
ru_ru: Не удалось найти файл "{file_path}".

source: Could not load "{file_path}" as a *.gpkg, a *.gramps, or an *.xml family tree.
de_de: Kann die Datei "{file_path}" nicht als *.gpkg, *.gramps, oder *.xml family tree laden.
ru_ru: Не удалось загрузить "{file_path}" как файл типа *.gpkg, *.gramps или *.xml семейного древа.

source: Country
de_de: Land
ru_ru: Страна

source: County
de_de: Landkreis
ru_ru: Округ

source: Create a new project
de_de: Neues Projekt erstellen
ru_ru: Создать новый проект

source: Create a new translation
de_de: Neue Übersetzung erstellen
ru_ru: Создать новый перевод

source: Create a new translation for an extension
de_de: Neue Übersetzung für eine Erweiterung erstellen
ru_ru: Создать новый перевод для расширения

source: Create events such as births and deaths by deriving their details from existing information.
de_de: Erstelle Ereignisse wie Geburten und Todesfälle, indem du deren Details aus vorhandenen Informationen ableitest.
ru_ru: Создание таких событий, как рождения и смерть, на основе существующей информации.

source: Created {created_derivations} additional {event_type} events based on existing information.
de_de: {created_derivations} zusätzliche {event_type} Ereignisse auf der Grundlage vorhandener Informationen erstellt.
ru_ru: Создано {created_derivations} производных событий типа {event_type} на основе существующей информации.

source: Cremation
de_de: Feuerbestattung
ru_ru: Кремация

source: Death
de_de: Tod
ru_ru: Смерть

source: Department
ru_ru: Отдел

source: Deriver
de_de: Ableiter
ru_ru: Производные

source: Deriving...
de_de: Ableiten...
ru_ru: Создание производных событий...

source: Descendant names include
de_de: Zu den Namen der Nachkommen gehören
ru_ru: Имена потомков

source: Description, licensing, and image history
de_de: Beschreibung, Lizenzierung und Bildgeschichte
ru_ru: Описание, лицензирование и история изображения

source: Determine if people can be proven to have died. If not, mark them and their associated entities private.
de_de: Stellen Sie fest, ob der Tod von Personen nachgewiesen werden kann. Wenn nicht, markieren Sie sie und die zugehörigen Entitäten als privat.
ru_ru: Определите, можно ли доказать, что люди умерли. Если нет, пометьте их и связанные с ними объекты как личные.

source: Display interactive family trees using <a href="https://cytoscape.org/">Cytoscape</a>.
de_de: Interaktive Stammbäume mit <a href="https://cytoscape.org/">Cytoscape</a> anzeigen.
ru_ru: Отображайте интерактивные семейные древа с помощью <a href="https://cytoscape.org/">Cytoscape</a>.

source: Display interactive maps
de_de: Zeige Listen von Orten als interaktive Karten
ru_ru: Отображение мест в виде интерактивных карт

source: Display the HTTP API documentation in a user-friendly way using <a href="https://swagger.io/tools/swagger-ui">Swagger UI</a>.
de_de: Zeige die HTTP-API-Dokumentation auf benutzerfreundliche Weise mit <a href="https://swagger.io/tools/swagger-ui">Swagger UI</a> an.
ru_ru: Отображение документации по HTTP API в удобном для пользователя виде с помощью <a href="https://swagger.io/tools/swagger-ui">Swagger UI</a>.

source: District
de_de: Bezirk
ru_ru: Район

source: Divorce
de_de: Scheidung
ru_ru: Развод

source: Do you mean one of {available_options}?
ru_ru: Вы имеете в виду один из {available_options}?

source: Do you mean {available_option}?
de_de: Meinst du {available_option}?
ru_ru: Вы имеете в виду {available_option}?

source: Do you want to add another locale?
ru_ru: Вы хотите добавить еще один язык?

source: Do you want to load a Gramps family tree?
ru_ru: Вы хотите загрузить семейное древо Gramps?

source: E.g. "%(example)s"
de_de: Z.B. "%(example)s"
ru_ru: Например, %(example)s

source: Emigration
de_de: Auswanderung
ru_ru: Эмиграция

source: Enclosure
de_de: Anhang
ru_ru: Приложение

source: Enclosures
de_de: Anhänge
ru_ru: Приложения

source: Engagement
de_de: Verlobung
ru_ru: Помолвка

source: Enrich your ancestry with information from Wikipedia
ru_ru: Обогатите свое семейное древо информацией из Википедии

source: Entity type
de_de: Entitätstyp
ru_ru: Тип объекта

source: Event
de_de: Ereignis
ru_ru: Событие

source: Events
de_de: Ereignisse
ru_ru: События

source: Exactly {expected} items are required, but found {actual}.
ru_ru: Требуются именно {expected} элементов, но найдено {actual}.

source: Exit the search
de_de: Suche beenden
ru_ru: Завершить поиск

source: Explore a demonstration site
ru_ru: Ознакомьтесь с демонстрационным сайтом

source: External links
de_de: Externe Links
ru_ru: Внешние ссылки

source: Facts
de_de: Fakten
ru_ru: Факты

source: Family
de_de: Familie
ru_ru: Семья

source: Farm
de_de: Bauernhof
ru_ru: Ферма

source: Female
de_de: Weiblich
ru_ru: Женщина

source: File
de_de: Datei
ru_ru: Файл

source: File reference
ru_ru: Ссылка на файл

source: File references
ru_ru: Ссылки на файлы

source: Files
de_de: Dateien
ru_ru: Файлы

source: Filters
de_de: Filter
ru_ru: Фильтры

source: Find Betty on GitHub
de_de: Besuche Betty auf GitHub
ru_ru: Найти Betty на GitHub

source: Find out more about this image on Wikimedia Commons.
de_de: Mehr über dieses Bild erfährst du auf Wikimedia Commons.
ru_ru: Узнайте больше об этом изображении на Wikimedia Commons.

source: Funeral
de_de: Beerdigung
ru_ru: Похороны

source: Generate a static site
ru_ru: Создание статического сайта

source: Generated {completed_job_count} out of {total_job_count} items ({completed_job_percentage}%).
ru_ru: Создано {completed_job_count} из {total_job_count} элементов ({completed_job_percentage}%).

source: Generating JSON Schema...
de_de: Generiere JSON Schema...
ru_ru: Создание схемы JSON...

source: Generating OpenAPI specification...
de_de: Generiere OpenAPI Spezifikation...
ru_ru: Создание спецификации OpenAPI...

source: Generating localized public files in {locale}...
de_de: Erzeugen von lokalisierten öffentlichen Dateien in {locale}...
ru_ru: Создание локализованных публичных файлов на языке {locale}...

source: Generating static public files...
de_de: Erzeuge statische, öffentliche Dateien...
ru_ru: Создание статических публичных файлов...

source: Generating your site to {output_directory}.
de_de: Erzeuge deine Site nach {output_directory}.
ru_ru: Создание Вашего сайта в {output_directory}.

source: Go to the front page
ru_ru: Перейти на главную страницу

source: Gramps XML must be compatible with version {supported_gramps_xml_version}. Gramps XML {loaded_gramps_xml_version} is not supported.
ru_ru: Gramps XML должен быть совместим с версией {supported_gramps_xml_version}. Gramps XML версии {loaded_gramps_xml_version} не поддерживается.

source: HTTP API Documentation
de_de: HTTP API Dokumentation
ru_ru: Документация HTTP API

source: Hamlet
de_de: Weiler
ru_ru: Деревня

source: I'm sorry, dear, but it seems there are no events.
de_de: Es tut mir leid, aber sieht so aus, als ob es keine Ereignisse gibt.
ru_ru: События не найдены.

source: I'm sorry, dear, but it seems there are no media.
de_de: Es tut mir leid, aber sieht so aus, als ob es keine Medien gibt.
ru_ru: Медиафайлы не найдены.

source: I'm sorry, dear, but it seems there are no people.
de_de: Es tut mir leid, aber sieht so aus, als ob es keine Personen gibt.
ru_ru: Люди не найдены.

source: I'm sorry, dear, but it seems there are no places.
de_de: Es tut mir leid, aber sieht so aus, als ob es keine Orte gibt.
ru_ru: Места не найдены.

source: I'm sorry, dear, but it seems there are no sources.
de_de: Es tut mir leid, aber sieht so aus, als ob es keine Quellen gibt.
ru_ru: Источники не найдены.

source: I'm sorry, dear, but it seems there is nothing to show.
ru_ru: Данных для отображения не найдено.

source: I'm sorry, dear, but it seems this page does not exist.
ru_ru: Страница не существует.

source: I'm sorry, dear, but it seems you're not allowed to view this page.
ru_ru: Просмотр страницы запрещен.

source: I'm sorry, dear, but it seems you're not logged in.
ru_ru: Вы не вошли в систему.

source: Immigration
de_de: Einwanderung
ru_ru: Иммиграция

source: Informant
ru_ru: Информатор

source: Invalid JSON: {error}.
ru_ru: Недопустимый JSON: {error}.

source: Invalid YAML: {error}.
ru_ru: Недопустимый YAML: {error}.

source: Keywords
de_de: Schlüsselwörter
ru_ru: Ключевые слова

source: Language
de_de: Sprache
ru_ru: Язык

source: Last modified on %(last_modified)s
de_de: Zuletzt geändert am %(last_modified)s
ru_ru: Последнее изменение %(last_modified)s

source: License
de_de: Lizenz
ru_ru: Лицензия

source: Load <a href="https://gramps-project.org/">Gramps</a> family trees.
de_de: Lade <a href="https://gramps-project.org/">Gramps</a>Stammbäume.
ru_ru: Загрузить семейное древо <a href="https://gramps-project.org/">Gramps</a> .

source: Loaded the configuration from {configuration_file_path}.
de_de: Konfigurationsdatei von {configuration_file_path} geladen.
ru_ru: Загружена конфигурация из {configuration_file_path}.

source: Loaded {citation_count} citations.
ru_ru: Загружено {citation_count} цитат.

source: Loaded {event_count} events.
de_de: {event_count} Ereignisse geladen.
ru_ru: Загружено {event_count} событий.

source: Loaded {file_count} files.
de_de: {file_count} Dateien geladen.
ru_ru: Загружено {file_count} файлов.

source: Loaded {note_count} notes.
de_de: {note_count} Anmerkungen geladen.
ru_ru: Загружено {note_count} заметок.

source: Loaded {person_count} people.
de_de: {person_count} Personen geladen.
ru_ru: Загружено {person_count} человек.

source: Loaded {place_count} places.
de_de: {place_count} Orte geladen.
ru_ru: Загружено {place_count} мест.

source: Loaded {repository_count} repositories as sources.
de_de: {repository_count} Repositorien als Quellen geladen.
ru_ru: Загружено {repository_count} репозиториев в качестве источников.

source: Loaded {source_count} sources.
de_de: {source_count} Quellen geladen.
ru_ru: Загружено {source_count} источников.

source: Loading "{file_path}"...
de_de: Lade "{file_path}"...
ru_ru: Загрузка "{file_path}"...

source: Locale aliases must not contain slashes.
de_de: Gebietsschema-Aliase dürfen keine Schrägstriche enthalten.
ru_ru: Языковые псевдонимы не должны содержать символ "/".

source: Locality
de_de: Örtlichkeit
ru_ru: Местность

source: MMMM d
de_de: d MMMM
ru_ru: d MMMM

source: MMMM d, y
de_de: d MMMM y
ru_ru: d MMMM y г.

source: MMMM, y
ru_ru: MMMM y г.

source: Male
de_de: Männlich
ru_ru: Мужчина

source: Maps
de_de: Karten
ru_ru: Карты

source: Marriage
de_de: Hochzeit
ru_ru: Брак

source: Media
de_de: Medien
ru_ru: Медиа

source: Media references
de_de: Medienreferenzen
ru_ru: Ссылки на медиа

source: Menu
de_de: Menü
ru_ru: Меню

source: Missing
de_de: Fehlend
ru_ru: Недостающий

source: Municipality
de_de: Gemeinde
ru_ru: Муниципалитет

source: Neighborhood
de_de: Nachbarschaft
ru_ru: Окрестности

source: No part may be reproduced or distributed in any form or by any means, without express written permission from the copyright holder, or unless permitted by copyright law.
ru_ru: Никакая часть не может быть воспроизведена или распространена в любой форме или любыми средствами без явного письменного разрешения правообладателя или если это не разрешено законом об авторском праве.

source: Non-binary
de_de: Divers
ru_ru: Небинарный

source: Note
de_de: Notiz
ru_ru: Заметка

source: Notes
de_de: Notizen
ru_ru: Заметки

source: Number
de_de: Nummer
ru_ru: Номер

source: Occupation
de_de: Beruf
ru_ru: Занятие

source: One or more of these requirements must be met
de_de: Eine oder mehrere dieser Anforderungen müssen erfüllt sein
ru_ru: Одно или несколько из этих требований должны быть выполнены

source: Organizer
de_de: Veranstalter
ru_ru: Организатор

source: Other attendees
de_de: Andere Teilnehmer
ru_ru: Другие участники

source: Other places contained by this one
ru_ru: Другие места, содержащиеся в этом

source: Page not found
de_de: Seite nicht gefunden
ru_ru: Страница не найдена

source: Parish
de_de: Pfarrgemeinde
ru_ru: Приход

source: People
de_de: Personen
ru_ru: Люди

source: Permanent link to this section.
de_de: Permanenter Verweis auf diesen Abschnitt.
ru_ru: Постоянная ссылка на этот раздел.

source: Person
ru_ru: Человек
