Repository: pypi-data/pypi-mirror-401
Catalog: packages/metapensiero.sphinx.patchdb/metapensiero_sphinx_patchdb-4.4.tar.gz/metapensiero_sphinx_patchdb-4.4/src/metapensiero/sphinx/patchdb/locale/*/LC_MESSAGES/metapensiero-sphinx-patchdb.po
Languages: it

source: Error: %s
it: Errore: %s

source: (any revision)
it: (qualsiasi revisione)

source: (revision %(revno)d)
it: (revisione %(revno)d)

source: After any other script
it: Dopo tutti gli altri script

source: Assume missing patches are already applied, do not re-execute them.
it: Assumi che gli script mancanti siano già stati applicati, non rieseguirli.

source: Be quiet, emit only error messages.
it: Emetti solo messaggi di errore.

source: Before any other script
it: Prima di qualsiasi altro script

source: Brings
it: Implementa

source: Condition
it: Condizione

source: Conditions
it: Condizioni

source: Define an arbitrary variable usable as “{{VARNAME}}” within a script. VAR must be something like “varname=value”. This option may be given multiple times.
it: Definisce una variabile arbitraria usabile come “{{VARNAME}}” in uno script. VAR deve essere qualche cosa nella forma “nomevariabile=valore”. Questa opzione può essere specificata più di una volta.

source: Depends on
it: Dipende da

source: Direct dependants
it: Dipendenze dirette

source: Don't apply patches, just list them.
it: Non applicare gli script, elencali solamente.

source: Done, applied %d script
it: Fatto, applicato %d script

source: Driver to access MySQL, defaults to “pymysql”.
it: Driver per accedere a MySQL, di default “pymysql”.

source: Drops
it: Elimina

source: Emit debug messages.
it: Emetti i messaggi di debug.

source: Encoding used by the MySQL driver, defaults to “utf8mb4”.
it: Codifica usata dal driver MySQL, di default “utf8mb4”.

source: Error: %s
it: Errore: %s

source: Error: could not apply %d scripts due to circular dependencies
it: Errore: impossibile applicare %d script a causa di dipendenze circolari

source: Execute always
it: Applicato ogni volta

source: File insertion disabled
it: Inclusione disabilitata

source: Go on with the next script, skipping any succeding statements of the failing script
it: Continua con il prossimo script, saltando le istruzioni successive a quella che ha generato l'errore

source: Host name where MySQL server runs, defaults to “localhost”.
it: Nome dell'host del server MySQL, di default “localhost”.

source: Ignore the error and keeps going with the remaining statements in the script
it: Ignora gli errore e prosegui con le istruzioni successive dello script

source: Introduce an arbitrary assertion usable as a pre-condition by the scripts. NAME may be a simple string or something like “production=true”. This option may be given multiple times.
it: Introduce una affermazione arbitraria usabile come precondizione in uno script. NAME può essere una semplice stringa oppure nella forma “produzione=true”. Questa opzione può essere specificata più di una volta.

source: Invalid variable: %s
it: Variabile non valida: %s

source: Missing mandatory ID for the directive "%s".
it: La direttiva "%s" richiede un ID.

source: One or more archives containing collected scripts. May be either plain file names or package relative paths like “package.name:some/file”.
it: Uno o più archivi contenenti degli script. Si possono specificare sia nomi di file piuttosto che percorsi relativi tipo “nome.pacchetto:qualche/file”.

source: Perform a backup of the database in directory DIR before doing anything, that by default (or by specifying “None”) does not happen.
it: Esegui un backup del database nella directory DIR prima di fare qualsiasi cosa, che di norma (oppure quando viene specificato “None”) non viene effettuato.

source: Port number used by the MySQL server, defaults to “3306”.
it: Porta usata dal server MySQL, di default “3306”.

source: Preceeds
it: Precede

source: Reference to an unknown script: %(scriptid)r
it: Riferimento a uno script sconosciuto: %(scriptid)r

source: Replaces
it: Sostituisce

source: Script "%(scriptid)s" in "%(docname)s" at line %(lineno)d: ID contains "@", not allowed
it: Script "%(scriptid)s" in "%(docname)s" alla riga %(lineno)d: ID contiene carattere non permesso "@"

source: Script "%(scriptid)s" in "%(docname)s" at line %(lineno)d: ID is not unique, there is another one in "%(other)s"!
it: Script "%(scriptid)s" in "%(docname)s" alla riga %(lineno)d: ID non univoco, duplicato in "%(other)s"!

source: Script "%(scriptid)s" in "%(docname)s" at line %(lineno)d: ID is too long, maximum allowed length is %(maxlen)d characters!
it: Script "%(scriptid)s" in "%(docname)s" alla riga %(lineno)d: ID troppo lungo, massimo %(maxlen)d caratteri!

source: Script "%(scriptid)s" in "%(docname)s" at line %(lineno)d: bad option (%(error)s)
it: Script "%(scriptid)s" in "%(docname)s" alla riga %(lineno)d: opzione errata (%(error)s)

source: Script "%(scriptid)s" in "%(docname)s" at line %(lineno)d: circular include of file %(filename)r
it: Script "%(scriptid)s" in "%(docname)s" alla riga %(lineno)d: inclusione circolare del file %(filename)r

source: Script "%(scriptid)s" in "%(docname)s" at line %(lineno)d: content and :file: option are mutually exclusive
it: Script "%(scriptid)s" in "%(docname)s" alla riga %(lineno)d: impossibile specificare contemporaneamente contenuto e opzione :file:

source: Script "%(scriptid)s" in "%(docname)s" at line %(lineno)d: could not read included file %(filename)r with encoding %(encoding)r, try setting a different :encoding: option
it: Script "%(scriptid)s" in "%(docname)s" alla riga %(lineno)d: impossibile includere %(filename)r con codifica %(encoding)r, prova a impostarne una diversa con l'opzione :encoding:

source: Script "%(scriptid)s" in "%(docname)s" at line %(lineno)d: include file %(filename)r not found or unreadable
it: Script "%(scriptid)s" in "%(docname)s" alla riga %(lineno)d: impossibile includere %(filename)r, non esiste oppure non leggibile

source: Script ID:
it: ID:

source: Script index
it: Indice degli script

source: Scripts
it: Script

source: Select the Firebird context.
it: Seleziona il contesto Firebird.

source: Select the MySQL context.
it: Seleziona il contesto MySQL.

source: Select the PostgreSQL context. DSN is a string of the kind “host=localhost dbname=mydb user=myself password=ouch”.
it: Seleziona il contesto PostgreSQL. DSN è una stringa nel formato “host=localhost dbname=miodb user=iostesso password=blabla”.

source: Select the SQLite context.
it: Seleziona il contesto SQLite.

source: Specify where to write the execution log.
it: Specifica dove scrivere il log dell'esecuzione.

source: The %(scriptid)s (defined in %(docname)s at line %(lineno)s) brings an unknown script "%(other)s"
it: La %(scriptid)s (definita in %(docname)s alla riga %(lineno)s) implementa uno script sconosciuto "%(other)s"

source: The %(scriptid)s (defined in %(docname)s at line %(lineno)s) brings script "%(other)s" to revision %(newrev)s, but it's still at revision %(currev)s
it: La %(scriptid)s (definita in %(docname)s alla riga %(lineno)s) implementa lo script "%(other)s" alla revisione %(newrev)s, ma è ancora alla revisione %(currev)s

source: The %(scriptid)s (defined in %(docname)s at line %(lineno)s) depends on an unknown script "%(other)s"
it: Lo %(scriptid)s (definito in %(docname)s alla riga %(lineno)s) dipende da uno script sconosciuto "%(other)s"

source: The %(scriptid)s (defined in %(docname)s at line %(lineno)s) references an unknown script "%(other)s"
it: Lo %(scriptid)s (definito in %(docname)s alla riga %(lineno)s) referenzia uno script sconosciuto "%(other)s"

source: Upgrading:
it: Aggiornamento:

source: Username to log into the database.
it: Nome utente per accedere al database.

source: Would apply %s
it: Applicherei %s

source: You must select exactly one database with either “--postgresql”, “--firebird”, “--mysql” or “--sqlite”!
it: Devi selezionare un database con “--postgresql”, “--firebird”, “--mysql” o “--sqlite”!
