#示例代码 透视模式 从文件导入
import turtleGL
#透视模式需先定义相机
camera = turtleGL.camera('turtleGL from file example')
camera.camera_position = [-101,-121,131]#相机位置
camera.camera_direction = [1,1,-1]#相机方向
camera.camera_focal = 300#焦距
camera.ray = [1,1,-1]#光照方向
camera.type = 1#透视模式
camera.rend = 1#使用光照阴影

#创建场景
scene = turtleGL.scene()
#边信息自定义
scene.line = [[[[50.0, 50.0, 0.0], [-50.0, 50.0, 0.0]], '#000000'], 
              [[[-50.0, 50.0, 0.0], [-50.0, -50.0, 0.0]], '#000000'], 
              [[[-50.0, -50.0, 0.0], [50.0, -50.0, 0.0]], '#000000'], 
              [[[50.0, -50.0, 0.0], [50.0, 50.0, 0.0]], '#000000'], 
              [[[50.0, 50.0, 100.0], [-50.0, 50.0, 100.0]], '#000000'], 
              [[[-50.0, 50.0, 100.0], [-50.0, -50.0, 100.0]], '#000000'], 
              [[[-50.0, -50.0, 100.0], [50.0, -50.0, 100.0]], '#000000'], 
              [[[50.0, -50.0, 100.0], [50.0, 50.0, 100.0]], '#000000'], 
              [[[50.0, 50.0, 0.0], [50.0, 50.0, 100.0]], '#000000'], 
              [[[-50.0, 50.0, 0.0], [-50.0, 50.0, 100.0]], '#000000'], 
              [[[-50.0, -50.0, 0.0], [-50.0, -50.0, 100.0]], '#000000'], 
              [[[50.0, -50.0, 0.0], [50.0, -50.0, 100.0]], '#000000']]
#面信息自定义
scene.face = [[[[50.0, 50.0, 0.0], [-50.0, 50.0, 0.0], [-50.0, -50.0, 0.0], [50.0, -50.0, 0.0]], '#FF0000'], 
              [[[50.0, 50.0, 0.0], [50.0, 50.0, 100.0], [50.0, -50.0, 100.0], [50.0, -50.0, 0.0]], '#0000FF'], 
              [[[-50.0, 50.0, 0.0], [-50.0, -50.0, 0.0], [-50.0, -50.0, 100.0], [-50.0, 50.0, 100.0]], '#FFFF00'], 
              [[[50.0, 50.0, 0.0], [-50.0, 50.0, 0.0], [-50.0, 50.0, 100.0], [50.0, 50.0, 100.0]], '#FF00FF'], 
              [[[50.0, 50.0, 100.0], [-50.0, 50.0, 100.0], [-50.0, -50.0, 100.0], [50.0, -50.0, 100.0]], '#00FF00'], 
              [[[-50.0, -50.0, 0.0], [50.0, -50.0, 0.0], [50.0, -50.0, 100.0], [-50.0, -50.0, 100.0]], '#00FFFF']]

#导出
scene.export_line('example_line.csv')
scene.export_face('example_face.csv')
#导入
scene.import_line('example_line.csv')
scene.import_face('example_face.csv')


#绘制次序整理
scene.sort_line_avg(camera.camera_position)#仅边
scene.sort_face_avg(camera.camera_position)#仅面
scene.sort_all_avg(camera.camera_position)#全部整理，直接返回结构化数据，不修改对象

#绘制 包含边线
camera.draw_from_scene(scene.sort_all_avg(camera.camera_position))

#绘制 仅边
#camera.draw_from_scene(scene.line)

#绘制 仅面
#camera.draw_from_scene(scene.face)

#显示轴
#camera.draw_axis(10)
camera.done()